
#define LEN 5


typedef const char* strss;
strss String[] = {
	"相信十年后的八月", "我们还会相遇",
	"月上柳梢头", "人约黄昏后",
	"我宁愿错过", "也不愿意相遇",
	"最是人间留不住", "朱颜辞镜花辞树",
	"彼岸花花开彼岸", "断肠草草断肝肠"
};

strss verb[] = {
	"", "睡", "搞",
	"转换", "回顾", "吃掉", "处理", "发起", "帮扶", "孕育", "模拟",
	"歪曲", "发表", "跨越", "斩断", "尝试", "服务", "重视", "吸纳",
	"呈现", "统计", "抓取", "调动", "破坏", "赋予", "服务", "包裹",
	"歌唱", "阻止", "排除", "发酵", "解放", "原谅", "缓解", "抄袭",
	"超越", "意在", "宣告", "补偿", "掌控", "摆脱", "发掘", "掌控",
	"提携", "舍弃", "违反", "食用", "虚拟", "越过", "看穿", "乞求",
	"假设", "输出", "诅咒", "指示", "对抗", "遵照", "吟唱", "逮捕",
	"奴役", "挖掘", "挤压", "放置", "取消", "得到", "关闭", "阻止",
	"斩断", "沉没", "推算", "置入", "揭开", "完善", "解决", "检视",
	"模糊", "掌控", "顺从", "暴揍", "介绍", "爆破", "洞察", "抓取",
	"签约", "再造", "合并", "分离", "构成", "矫正", "分类", "策划",
	"辱骂", "虚构", "超越", "导致", "声讨", "抛弃", "超越", "离开",
	"宣告", "捕获", "放松", "批判", "记录", "挖掘", "点评", "混淆",
	"跨越", "呼叫", "洞察", "庇护", "解构", "安置", "激活", "安置",
	"演绎", "运用", "重迭", "顺应", "监视", "发掘", "观察", "指点",
	"存储", "抄袭", "聚焦", "爆破", "背离", "突出", "点到", "替代",
	"贩卖", "调动", "驯服", "浇灌", "点评", "解放", "折叠", "导致",
	"再造", "成为", "阻碍", "补偿", "奴役", "帮扶", "超越", "问候",
	"摆脱", "发掘", "感知", "设置", "提炼", "替代", "植入", "束缚",
	"繁殖", "解放", "收集", "证明", "假设", "记录", "突出", "泥塑",
	"通知", "庇护", "约定", "寻找", "重视", "指点"
};

strss adj[] = {
	"黏糊糊", "深奥", "斗争", "伟大", "不确定", "非规则样式", "未来",
	"原始", "普世", "平衡", "截肢", "组织性", "被保护", "无尽",
	"难以描述", "紧密结合", "可疑", "冲动", "七千个单位", "普通", "唯一",
	"高度成熟", "基础", "动荡", "普遍", "崩塌", "社会性", "在场", "犹豫",
	"不存在", "无神论", "简陋", "另类", "形式主义", "旗帜鲜明", "革命性",
	"严谨细致", "截然不同", "刺激", "表面", "朴素", "多元化", "中心",
	"叙事性", "遗失", "明快", "激动", "定向", "象征性", "成熟", "殖民",
	"永远正确", "多元", "整体", "凝固", "清晰", "富有张力", "化",
	"无助", "浅陋", "统一", "惊人", "割裂", "颠倒", "画地为牢", "无政府",
	"尖锐", "腐烂", "伟大", "金融化", "错综复杂", "清晰", "病态", "虚张声势",
	"适当", "恰恰相反", "如实", "遗忘", "庄严", "无往不利", "精细化", "遗失",
	"病态", "不存在", "零星", "核心", "无名", "不存在", "凝固", "毫无特色",
	"置身事外", "喧嚣", "唯一", "口无遮拦", "众口难调", "她", "它", "他",
	"祂", "虚有其表", "不存在", "不可言喻", "简陋", "永远正确", "可疑",
	"简陋", "荒谬", "明快", "旋转上升", "纯粹", "不漏痕迹", "分裂",
	"新生", "昏睡", "规范性", "描述性", "假设严密", "唯一可信", "谬误",
	"沉默", "中立", "伦理", "众所周知", "灿烂", "你", "羞耻", "细致入微",
	"条件反射", "轻率", "自信满满", "无序", "充裕", "高岸", "风格化", "分裂",
	"低廉", "零星", "基础", "另类", "深奥", "形式主义", "建筑性", "一线城市",
	"犹豫", "落后", "截然不同", "空空如也", "永不停息", "随便", "病态",
	"斗争", "不正当", "体内", "信息性", "美术馆", "戏剧性", "恒常",
	"装饰性", "全知", "连贯"
};

strss noun[] = {
	"宣言", "延续", "推销", "战略合作", "光", "景观", "机制", "柱式", "延续", "危机",
	"教堂", "消费", "传说", "偶像崇拜", "自行车", "异性恋", "参与阶梯", "蒙面者", "交易",
	"信号", "皮", "意识形态", "文明", "泛在信息社会", "海报", "火灾", "公共雕塑", "逻辑",
	"阐释学", "兔子", "复制", "声音", "外套", "新浪潮", "罪孽", "界线", "代价", "篇幅",
	// 某某主义
	"绝对主义", "荒诞主义", "唯美主义", "利他主义", "结构主义", "融合主义", "浪漫主义",
	"功利主义", "资本主义", "集体主义", "建构主义", "犬儒主义", "演绎主义", "社会主义",
	"教条主义", "折衷主义", "平均主义", "情感主义", "经验主义", "副现象论", "实用主义",
	"幸福主义", "存在主义", "有序主义", "女性主义", "自由意志", "快乐主义", "虚无主义",
	"唯心主义", "个人主义", "唯物主义", "神秘主义", "自然主义", "客观主义", "理性主义",
	"乐观主义", "生命力论", "观点主义", "厌世主义", "相对主义", "怀疑论", "霸权主义",
	"有神论", "决定论", "永恒论", "历史论", "无神论", "泛神论",
	"人类中心主义", "无政府主义", "斯多葛主义", "后现代主义",
	// 相对论、量子力学等
	"恒星", "相对论", "量子力学", "宇宙", "黑洞", "星系", "宇宙学",
	"空间", "曲率", "引力", "时间", "热力学", "墒",
	"光锥", "相对速度", "张量", "四维平凡流形", "洛伦茨变换",
	"傅里叶变换", "四维平直时空", "场域"
	// 音乐，艺术
	"颜色", "爵士乐" "乐队", "公共雕塑", "电子乐", "艺术定义", "当代艺术驱动器",
	"摇滚乐", "民谣", "乡村音乐", "轻音乐", "流行音乐",
	// 某种革命
	"乌托邦", "伦理学", "偶像崇拜", "祖先崇拜", "对立", "误解",
	"模式", "错觉", "逝者", "二元论", "快乐", "机器人",
	"平克弗洛伊德", "现实主义", "教徒", "格林伯格", "元宇宙", "新浪潮",
	"液体", "不可知论", "新大陆", "文章", "难民", "食物", "精神",
	"态度", "错觉", "传说", "社群", "传说", "夸富宴", "兔子",
	"革命", "社群", "罪孽", "同性恋", "体验", "代价",
	"权力", "形式", "神赐语言", "传统",
	"文章", "声音", "黄昏", "青春", "华裔", "歌手", "自由",
	"系统", "身体", "文章", "重生", "道士", "独立空间",
	"对立", "圣地", "同谋者", "恶性循环", "流浪汉",
	"关系", "危机", "新陈代谢派", "鸡蛋", "概率", "钞票",
	"乐园", "爱", "错觉", "梦", "革命", "纪念碑", "战略合作", "关系",
	"恶性循环", "参与阶梯", "大数据", "论文", "锁", "个体户", "进化论",
	"底线", "权力", "造物主", "宣言",
	"危机", "世界观", "黄昏", "说教", "鸡蛋", "海报",
	"简化率", "矛盾", "来世", "角色扮演", "绷带", "红茶", "可乐",
	"人口原理", "阐述性理论", "意识形态", "自然科学", "实在论",
	"工具主义", "心灵意识","存在者"
};


int aaa, bbb, ccc;
void get_art_index_random(void) {
	aaa = rand() % (sizeof(verb)/sizeof(strss));
	bbb = rand() % (sizeof(adj)/sizeof(strss));
	ccc = rand() % (sizeof(noun)/sizeof(strss));
}